src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Виртуальный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНахожденияВБуфере</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаПоМощности</name>
    <type>
      <types>CatalogRef.ГруппыПоМощности</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСозданияСпецификации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерений</types>
    </type>
  </attributes>
  <attributes>
    <name>Канбан</name>
    <type>
      <types>CatalogRef.ВидыКанбанов</types>
    </type>
  </attributes>
  <attributes>
    <name>КолВКанбане</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КолКанбан</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ОсновныеЕдиницыИзмерений</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолнНаименование</name>
    <comment>Полное наименование, краткие характеристики</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Промывка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазделПоЕСКД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Товары</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловныеПриборы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УсловныйКоэффициентПЭО</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблоныТО</name>
    <type>
      <types>CatalogRef.ШаблоныТехОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапПроизводства</name>
    <type>
      <types>CatalogRef.ЭтапыПроизводства</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапЖизненногоЦикла</name>
    <type>
      <types>CatalogRef.ЭтапыЖизненногоЦикла</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидБрака</name>
    <type>
      <types>CatalogRef.ВидыБрака</types>
    </type>
  </attributes>
  <attributes>
    <name>Префикс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МинОстаток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПиковыеПродажи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗапрещеноКОтгрузке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКонтроля</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПереходНаРедизайн</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПересмотра</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ЛинииSMD</name>
    <attributes>
      <name>Линия</name>
      <type>
        <types>CatalogRef.ЛинииSMD</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЛинейкиSMD</name>
    <attributes>
      <name>Линейка</name>
      <type>
        <types>CatalogRef.Линейки</types>
      </type>
    </attributes>
    <attributes>
      <name>Основная</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/InformationRegisters/АналогиНормРасходов/АналогиНормРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АналогиНормРасходов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Норма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Владелец</name>
    <type>
      <types>CatalogRef.НормыРасходов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналогНормыРасходов</name>
    <type>
      <types>CatalogRef.АналогиНормРасходов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ИзвещенияОбИзменениях/ИзвещенияОбИзменениях.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИзвещенияОбИзменениях</name>
  <dimensions>
    <name>Элемент</name>
    <type>
      <types>CatalogRef.ТехОснастка</types>
      <types>CatalogRef.Документация</types>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.ТехОперации</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Извещение</name>
    <type>
      <types>CatalogRef.ИзвещенияОбИзменениях</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/Документация/Документация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Документация</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДокумента</name>
    <type>
      <types>EnumRef.ВидыДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Извещение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьПросмотрДляСЦ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/Номенклатура/Forms/ФормаИзмененияНормыРасходов/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
НормаРасходов = Параметры.НормаРасходов;
НаДату = Параметры.НаДату;
Позиция = Параметры.НормаРасходов.Позиция;
ВидЭлемента = Параметры.НормаРасходов.ВидЭлемента;
Элемент = Параметры.НормаРасходов.Элемент;
Норма = Параметры.Норма;
КонецПроцедуры

&НаСервере
Функция ИзменитьНаСервере()
	Если Элемент = НормаРасходов.Элемент Тогда
	Сообщить("Необходимо изменить элемент нормы расходов!");
	Возврат(Ложь);	
	КонецЕсли;
		Если НаДату = НачалоДня(ТекущаяДата()) Тогда
		ДатаИзм = ТекущаяДата();
		Иначе	
		ДатаИзм = НаДату;
		КонецЕсли;
	Попытка
	НачатьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция + 1;
	ТаблицаАналогов = ОбщегоНазначенияПовтИсп.ПолучитьАналогиНормРасходов(НормаРасходов,ДатаИзм,Истина);
		Для каждого ТЧ Из ТаблицаАналогов Цикл
		РАНР = РегистрыСведений.АналогиНормРасходов.СоздатьМенеджерЗаписи();
		РАНР.Период = ДатаИзм;
		РАНР.Владелец = ТЧ.Ссылка.Владелец;
		РАНР.АналогНормыРасходов = ТЧ.Ссылка;
		РАНР.Норма = 0;
		РАНР.Записать();	
		КонецЦикла;	
	РНР = РегистрыСведений.НормыРасходов.СоздатьМенеджерЗаписи();
	РНР.Период = ДатаИзм;
	РНР.Владелец = НормаРасходов.Владелец;
	РНР.Элемент = НормаРасходов.Элемент;
	РНР.НормаРасходов = НормаРасходов;
	РНР.Норма = 0;
	РНР.Записать();
	НР = Справочники.НормыРасходов.СоздатьЭлемент();
	НР.Владелец = Параметры.Спецификация;
	НР.Позиция = Позиция;
	НР.ВидЭлемента = ВидЭлемента;
	НР.Элемент = Элемент;
		Если ТипЗнч(Элемент) = Тип("СправочникСсылка.Документация") Тогда
		НР.Наименование = Строка(Элемент.ВидДокумента)+", "+Элемент.Наименование;
		Иначе	
		НР.Наименование = Строка(ВидЭлемента)+", "+Элемент.Наименование;
		КонецЕсли;
	НР.Примечание = Примечание;
	НР.Записать();
	РНР = РегистрыСведений.НормыРасходов.СоздатьМенеджерЗаписи();
	РНР.Период = ДатаИзм;
	РНР.Владелец = НР.Владелец;
	РНР.Элемент = НР.Элемент;
	РНР.НормаРасходов = НР.Ссылка;
	РНР.Норма = Норма;
	РНР.Записать(); 
		Если Не Извещение.Пустая() Тогда
		ИОИ = РегистрыСведений.ИзвещенияОбИзменениях.СоздатьМенеджерЗаписи();
	    //ИОИ.Период = НаДату;
		ИОИ.Элемент = Параметры.Спецификация;
		ИОИ.Извещение = Извещение;
		ИОИ.Записать();
		КонецЕсли; 		
	ЗафиксироватьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;Если ПараметрыСеанса.АктивнаТранзакция = 0 тогда СРМ_ОбменВебСервис.ОтправкаПослеТранзакции();КонецЕсли;
	Возврат(Истина);
	Исключение
	ОтменитьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;ПараметрыСеанса.ОбъектыСозданныеВТранзакции = Новый ХранилищеЗначения(Новый Массив);
	Сообщить(ОписаниеОшибки());
	Возврат(Ложь);
	КонецПопытки; 	
КонецФункции

&НаКлиенте
Процедура Изменить(Команда)
	Если ИзменитьНаСервере() Тогда
	ЭтаФорма.Закрыть(Истина);
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура Отменить(Команда)
ЭтаФорма.Закрыть(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ЭлементНачалоВыбора(Элем, ДанныеВыбора, СтандартнаяОбработка)
СтандартнаяОбработка = Ложь;
П = Новый Структура("ТекущаяСтрока",Элемент);
	Если Элементы.ВидЭлемента.ТекстРедактирования = "Материал" Тогда
	Результат = ОткрытьФормуМодально("Справочник.Материалы.ФормаВыбора",П);
		Если Результат = Неопределено Тогда
		Возврат;
		КонецЕсли;
	ИначеЕсли Элементы.ВидЭлемента.ТекстРедактирования = "Тех. операция" Тогда	
	Результат = ОткрытьФормуМодально("Справочник.ТехОперации.ФормаВыбора",П); 
		Если Результат = Неопределено Тогда
		Возврат;
		КонецЕсли;
	ИначеЕсли Элементы.ВидЭлемента.ТекстРедактирования = "Тех. оснастка" Тогда	
	Результат = ОткрытьФормуМодально("Справочник.ТехОснастка.ФормаВыбора",П); 
		Если Результат = Неопределено Тогда
		Возврат;
		КонецЕсли;	
	ИначеЕсли (Элементы.ВидЭлемента.ТекстРедактирования = "Документ")или
			  (Элементы.ВидЭлемента.ТекстРедактирования = "Программа")Тогда	
	Результат = ОткрытьФормуМодально("Справочник.Документация.ФормаВыбора",П); 
		Если Результат = Неопределено Тогда
		Возврат;
		КонецЕсли;	
	Иначе
	Результат = ОткрытьФормуМодально("Справочник.Номенклатура.ФормаВыбора",П); 
		Если Результат = Неопределено Тогда
		Возврат;
		КонецЕсли;		
	КонецЕсли;	
Элемент = Результат;
КонецПроцедуры

&НаСервере
Функция ПроверитьВидЭлемента()
	Если ВидЭлемента = Перечисления.ВидыЭлементовНормРасходов.Деталь или
		 ВидЭлемента = Перечисления.ВидыЭлементовНормРасходов.Набор или
		 ВидЭлемента = Перечисления.ВидыЭлементовНормРасходов.Узел или
		 ВидЭлемента = Перечисления.ВидыЭлементовНормРасходов.Основа Тогда
	Возврат(?(ТипЗнч(Элемент) = Тип("СправочникСсылка.Номенклатура"),Истина,Ложь));
	ИначеЕсли ВидЭлемента = Перечисления.ВидыЭлементовНормРасходов.Документ или
			  ВидЭлемента = Перечисления.ВидыЭлементовНормРасходов.Программа Тогда
    Возврат(?(ТипЗнч(Элемент) = Тип("СправочникСсылка.Документация"),Истина,Ложь));
	Иначе
	Возврат(Ложь);
	КонецЕсли; 	
КонецФункции

&НаКлиенте
Процедура ВидЭлементаПриИзменении(Элем)
	Если Не ПроверитьВидЭлемента() Тогда
	Элемент = Неопределено;	
	КонецЕсли;
КонецПроцедуры
